app/controllers/comments_controller.rb

	def create
		rating = params[:rating]
		player_name = params[:player_id]
		comment = params[:comment]
		author = params[:author]
		tripcode = Tripcode.secure(params[:tripcode], Rails.application.secrets.trip_secret)
		captcha_res = params["g-recaptcha-response"]
		google_res = JSON.parse(RestClient.post(
			'https://www.google.com/recaptcha/api/siteverify',
			:secret => Rails.application.secrets.recaptcha_key,
			:response => captcha_res
			))

		if google_res["success"] == true
			player = Player.find_by_name(player_name)
			if player.nil?
				player = Player.create(:name => player_name)
			end
			comment = Comment.create(:comment => comment, :player_id => player.id,
				:rating => rating.to_i, :byline => author, :tripcode => tripcode
				)
---
SELECT  "players".* FROM "players" WHERE "players"."name" = $1 LIMIT 1  [["name", "mememe"]]
INSERT INTO "players" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "memememe"], ["created_at", "2016-03-17 23:44:35.872140"], ["updated_at", "2016-03-17 23:44:35.872140"]]
INSERT INTO "comments" ("comment", "player_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["comment", "qwe"], ["player_id", "1"], ["created_at", "2016-03-17 23:44:35.906037"], ["updated_at", "2016-03-17 23:44:35.906037"]]