app/controllers/players_controller.rb

	def show
		@name = params[:id]
		@comments = []
		player = Player.find_by_name(@name)
		if !player.nil?
			@comments = Comment.where(player_id: player.id).order(created_at: :DESC)
---
SELECT  "players".* FROM "players" WHERE "players"."name" = $1 LIMIT 1  [["name", "mememe"]]
SELECT "comments".* FROM "comments" WHERE "comments"."player_id" = $1  ORDER BY "comments"."created_at" DESC  [["player_id", "1"]]